Tekla Open API Reference for Tekla Structures 2025
RebarMesh.EndHook Property
 The hook at the end of the reinforcing.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public RebarHookData EndHook { get; set; }
Public Property EndHook As RebarHookData
	Get
	Set
Property Value
Type: RebarHookData
See Also
Reference
RebarMesh Class
Tekla.Structures.Model Namespace